app/controllers/articles_controller.rb

	def show
		@article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? ORDER BY "articles"."id" ASC LIMIT 1  [["id", 1]]

	def create
  		@article = Article.new(article_params)
		@article.save
---
INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "adenir fica chupando o dedo"], ["created_at", Thu, 18 Jul 2013 14:37:36 UTC +00:00], ["title", "a separacao 2"], ["updated_at", Thu, 18 Jul 2013 14:37:36 UTC +00:00]]