app/controllers/comments_controller.rb

INSERT INTO "comments" ("article_id", "author_name", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 1], ["author_name", "adenir "], ["body", "o melhor que ja vi"], ["created_at", Thu, 18 Jul 2013 19:22:01 UTC +00:00], ["updated_at", Thu, 18 Jul 2013 19:22:01 UTC +00:00]]
---
	def create
  		@comment = Comment.new(comment_params)
  		@comment.comment_id = params[:comment_id]

  		@comment.save