app/controllers/hosts_controller.rb

SELECT "hosts".* FROM "hosts"
---
  def index
  		@hosts = Host.all

SELECT "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
  	@host = Host.find(params[:id])

INSERT INTO "hosts" ("created_at", "hostName", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 23 Jul 2013 13:52:52 UTC +00:00], ["hostName", "adenir.centralit"], ["updated_at", Tue, 23 Jul 2013 13:52:52 UTC +00:00]]
---
  def create
  	@host = Host.new(host_params)
  	@host.save

SELECT "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "hosts" WHERE "hosts"."id" = ?  [["id", 4]]
---
  def destroy
  		@host = Host.find(params[:id])
  		@host = Host.destroy(params[:id])

SELECT "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
  	@host = Host.find(params[:id])

SELECT "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT 1  [["id", "4"]]
---
  def update
  	@host = Host.find(params[:id])