app/controllers/tags_controller.rb

	def show
		@tag = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "6"]]